In [1]:
import pandas as pd

In [2]:
pd.Series([100,200,300,400,500])

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [5]:
df1 = pd.DataFrame([[100,200,300,400,500], ["AAA","BBB","CCC","DDD","EEE"]])

In [6]:
df1

     0    1    2    3    4
0  100  200  300  400  500
1  AAA  BBB  CCC  DDD  EEE

In [7]:
df1[2]

0    300
1    CCC
Name: 2, dtype: object

In [8]:
df1[2][1]

'CCC'

In [9]:
a = 111
an = 'ARJUN'
b = 222
bn = "BBB"
c = 333
cn = "CCC"

In [13]:
df_std = pd.DataFrame([[a,an,'HYD'],[b,bn,'DEL'],[c,cn,'VIZ']])

In [14]:
df_std

     0      1    2
0  111  ARJUN  HYD
1  222    BBB  DEL
2  333    CCC  VIZ

In [15]:
df_std[2]

0    HYD
1    DEL
2    VIZ
Name: 2, dtype: object

In [16]:
df_std[[2]]

     2
0  HYD
1  DEL
2  VIZ

In [18]:
type(df_std[2])

pandas.core.series.Series

In [19]:
type(df_std[[2]])

pandas.core.frame.DataFrame

#### DF with SCALAR

In [20]:
df_scalar = pd.DataFrame(9, index = [1,2,3,4,5], columns= ['Col1','Col2','Col3'])

In [21]:
df_scalar

   Col1  Col2  Col3
1     9     9     9
2     9     9     9
3     9     9     9
4     9     9     9
5     9     9     9

In [22]:
df_scalar['Col1']

1    9
2    9
3    9
4    9
5    9
Name: Col1, dtype: int64

In [23]:
df_scalar['Col2']

1    9
2    9
3    9
4    9
5    9
Name: Col2, dtype: int64

#### DF with LIST

In [28]:
list1 = ["APPLE","ORANGE","RED","BLUE","YELLOW"]

In [29]:
list1

['APPLE', 'ORANGE', 'RED', 'BLUE', 'YELLOW']

In [34]:
df_fruit = pd.DataFrame(list1, index = ["A","O","R","B","Y"], columns= ["Fruits"])

In [35]:
df_fruit

   Fruits
A   APPLE
O  ORANGE
R     RED
B    BLUE
Y  YELLOW

In [54]:
list_emp = [ ["AAA","PM",50000],['BBB',"TM",60000],["CCC","DEV",50000],['DDD',"TS",60000]]

In [55]:
list_emp

[['AAA', 'PM', 50000],
 ['BBB', 'TM', 60000],
 ['CCC', 'DEV', 50000],
 ['DDD', 'TS', 60000]]

In [56]:
df_emp = pd.DataFrame(list_emp, columns = ['ENAME','EDESG','ESAL'])

In [57]:
df_emp

  ENAME EDESG   ESAL
0   AAA    PM  50000
1   BBB    TM  60000
2   CCC   DEV  50000
3   DDD    TS  60000

In [58]:
df_emp["ESAL"]

0    50000
1    60000
2    50000
3    60000
Name: ESAL, dtype: int64

In [59]:
df_emp['ESAL'].sum()

220000

In [60]:
df_emp['ESAL'].mean()

55000.0

In [61]:
df_emp['ESAL'].max()

60000

In [62]:
f1 = df_emp['ESAL'].max()

In [63]:
f1

60000

In [64]:
df_emp

  ENAME EDESG   ESAL
0   AAA    PM  50000
1   BBB    TM  60000
2   CCC   DEV  50000
3   DDD    TS  60000

In [67]:
f2 = (df_emp['ESAL'] == f1)

In [68]:
df_emp[f2]

  ENAME EDESG   ESAL
1   BBB    TM  60000
3   DDD    TS  60000

In [71]:
ef1 = df_emp['ESAL'].min()

In [72]:
ef1

50000

In [74]:
ef2 = ( df_emp["ESAL"] == ef1 )

In [75]:
df_emp[ef2]

  ENAME EDESG   ESAL
0   AAA    PM  50000
2   CCC   DEV  50000